{
    "categories": {
        "0": "productivity",
        "1": "containers"
    },
    "data_tracked": false,
    "description": "This Customizable Alert Box plugin is designed to enhance user engagement on your Bubble.io app by displaying dynamic, stylish, and fully configurable alert notifications. Whether you need to show success messages, warnings, informational alerts, or error notifications, this plugin offers you a robust and flexible solution.\n\nKey Features:\n\n1. Predefined and Custom Styles:\n   - Choose from four predefined alert styles: Success, Warning, Info, and Error.\n   - Customize each style with your own colors, fonts, and icons to match your app's theme.\n\n2. Advanced Styling Options:\n   - Set border colors, background colors, and text colors.\n   - Customize font sizes and font types for the alert title and description.\n   - Add icons for different alert types (✔️, ⚠️, ℹ️, ❌), or use your own custom icons.\n\n3. Smooth Animations:\n   - Apply various animations like fade-in, slide-in, bounce, zoom, and flip to make alerts visually appealing and engaging.\n   - Control animation speed and style to suit your app's look and feel.\n\n4. Positioning and Display Control:\n   - Choose the alert box position on the screen (top-right, bottom-left, top-middle, etc.).\n   - Set timing for automatic dismissal or keep it open until the user manually closes it.\n   - Option to hide or show the close button for user control.\n\n5. Responsive and Easy to Integrate:\n   - The alert box is fully responsive and adjusts to different screen sizes seamlessly.\n   - Simple configuration through the plugin properties, making it easy to integrate into any Bubble.io project.\n\n6. Customization Options:\n   - Set custom timing for how long the alert remains visible.\n   - Toggle visibility for icons and close buttons based on your needs.\n   - Supports adding unique fonts to match your brand style.\n\nThis plugin is a perfect fit for anyone looking to add interactive and informative alerts to their Bubble.io applications, offering a professional and engaging user experience.",
    "image": "//meta-q.cdn.bubble.io/f1731412313911x265788252915759600/Logo.png",
    "license": "open_source",
    "name": "Plus Alerts - Custom Alert Box",
    "plugin_instructions": "Add the alert element trough your workflow. Configure its properties by selecting a predefined style (Success, Warning, Info, Error) or customize it using your own colors, fonts, and icons. Choose the display position (e.g., Top Right, Bottom Middle), set an animation style (e.g., Fade In, Bounce), and specify how long the alert should be visible. You can enable or disable icons and the close button as needed. Once configured, trigger the alert using workflows to display dynamic messages based on user interactions or app events. You can also change the predefined features on plugin screen."
}